# Pandas Test

## Importing CSV Data into Python

In [4]:
import pandas as pd
nifty = pd.read_csv('..\\Data\\niftydata.csv')

In [5]:
nifty.head()

   9/17/2007  4494.649902
0  9/18/2007  4546.200195
1  9/19/2007  4732.350098
2  9/20/2007  4747.549805
3  9/21/2007  4837.549805
4  9/24/2007  4932.200195

In [8]:
nifty = pd.read_csv('..\\Data\\niftydata.csv', sep=",")
nifty.head()

   9/17/2007  4494.649902
0  9/18/2007  4546.200195
1  9/19/2007  4732.350098
2  9/20/2007  4747.549805
3  9/21/2007  4837.549805
4  9/24/2007  4932.200195

In [7]:
nifty = pd.read_csv('F://Learning//Naresh IT//Data Science//Work Arena//Learnings//Learn DS//Notebooks//Data//niftydata.csv')
nifty.head()

   9/17/2007  4494.649902
0  9/18/2007  4546.200195
1  9/19/2007  4732.350098
2  9/20/2007  4747.549805
3  9/21/2007  4837.549805
4  9/24/2007  4932.200195

In [12]:
nifty = pd.read_csv('..\\Data\\niftydata.csv', sep=",", nrows = 2)
nifty

   9/17/2007  4494.649902
0  9/18/2007  4546.200195
1  9/19/2007  4732.350098

In [13]:
nifty = pd.read_csv('..\\Data\\niftydata.csv', sep=",", nrows = 2, header=None)
nifty

           0            1
0  9/17/2007  4494.649902
1  9/18/2007  4546.200195